-- init random
math.randomseed(os.time())

-- the request function that will run at each request
request = function()
    local array = {
        "Ро", "Ал", "Ил", "Да", "Ле", "Иг", "Ни", "Юр", "Ег", "Вс", "Де", "Лу", "Дм", "Ив", "Ге", "Яр", "Пл", "Ти", "Ми",
         "Ки", "Ев", "Ан", "Са", "Ар", "Бо", "Вл", "Гр", "Ко", "Ма", "Ел", "Вя", "Пё", "Ст", "Се", "За", "Па", "Ол", "Св",
          "Фё", "Ян", "Ва", "Гл", "Го", "Ад", "Ви", "Фи", "Як", "Ру", "Та", "Ве", "На", "Ек", "Кр", "Кс", "Зл", "По", "Юл",
           "Со", "Ди", "Ли", "Ул", "Ир", "Лю", "Зо", "Ка", "Аб", "Ав", "Аг", "Ак", "Ал", "Ан", "Ар", "Ас", "Аф", "Ба", "Бе",
            "Би", "Бл", "Бо", "Бу", "Бы", "Ва", "Вд", "Ве", "Ви", "Вл", "Во", "Вы", "Га", "Ге", "Гл", "Го", "Гр", "Гу", "Да",
             "Де", "Дм", "До", "Др", "Ду", "Дь", "Ев", "Ег", "Еж", "Ел", "Ем", "Ер", "Еф", "Жа", "Жд", "Жи", "Жу", "За", "Зв",
              "Зе", "Зи", "Зл", "Зо", "Зу", "Зы", "Ив", "Иг", "Из", "Ил", "Ис", "Ка", "Ки", "Кл", "Кн", "Ко", "Кр", "Ку", "Ла",
               "Ле", "Ли", "Ло", "Лу", "Лы", "Ль", "Лю", "Ма", "Ме", "Ми", "Мо", "Му", "На", "Не", "Ни", "Но", "Ов", "Од", "Оз",
                "Ок", "Ол", "Ор", "Ос", "Па", "Пе", "Пи", "Пл", "По", "Пр", "Пу", "Ра", "Ро", "Ру", "Ры", "Ря", "Са", "Св", "Се",
                 "Си", "Ск", "См", "Сн", "Со", "Сп", "Ст", "Су", "Сы", "Та", "Те", "Ти", "Тк", "То", "Тр", "Ту", "Ув", "Ул", "Ус",
                  "Ут", "Уш", "Фа", "Фе", "Фи", "Фо", "Фр", "Ха", "Хо", "Хр", "Ху", "Ца", "Цв", "Че", "Чи", "Чу", "Ша", "Шв", "Ше",
                   "Ши", "Шм", "Шу", "Ще", "Щу", "Юд", "Як", "Яш", "Аа", "Мм", "Цц", "Яя"
    }

    -- define the path that will search for q=%v 9%v being a random number between 0 and 1000)
    local first_name = array[math.random(#array)]
    local last_name = array[math.random(#array)]

    local url_path = "/user/search?first_name=" .. encodeURI(first_name) .. "&last_name=" .. encodeURI(last_name)

    -- Return the request object with the current URL path
    return wrk.format("GET", url_path)
end

function encodeURI(str)
    if (str) then
        str = string.gsub(str, "\n", "\r\n")
        str = string.gsub(str, "([^%w ])", function(c) return string.format("%%%02X", string.byte(c)) end)
        str = string.gsub(str, " ", "+")
    end
    return str
end